src/cf/Documents/ВозвратПодарочныхСертификатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ВозвратПодарочныхСертификатов</Name>
			<Comment>Добавил Шаравин Евгений 19.05.2025 по проектной работе курса "Архитектор 1С" (УЦ ОТУС)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПодарочныеСертификаты</xr:Item>
				<xr:Item>InformationRegister.ИсторияСтатусовПодарочныхСертификатов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПодарочныеСертификаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодарочныйСертификат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодарочныеСертификаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/AccumulationRegisters/ПодарочныеСертификаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ПодарочныеСертификаты</Name>
			<Comment>Добавил Шаравин Евгений 18.05.2025 по проектной работе курса "Архитектор 1С" (УЦ ОТУС)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодарочныеСертификаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Documents/ВозвратПодарочныхСертификатов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьНеиспользованныйОстатокСтоимости();
	ИтогоСтоимость = ПолучитьИтоговуюСтоимостьПоВалютам();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗаполнитьНеиспользованныйОстатокСтоимости();
	ИтогоСтоимость = ПолучитьИтоговуюСтоимостьПоВалютам();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗаполнитьНеиспользованныйОстатокСтоимости();
	ИтогоСтоимость = ПолучитьИтоговуюСтоимостьПоВалютам();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНеиспользованныйОстатокСтоимости()
	МассивСертификатов = Объект.ПодарочныеСертификаты.Выгрузить(, "ПодарочныйСертификат").ВыгрузитьКолонку("ПодарочныйСертификат");

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодарочныеСертификаты.Ссылка КАК ПодарочныйСертификат,
		|	ЕСТЬNULL(ПодарочныеСертификатыОстатки.СуммаОстаток, 0) КАК НеиспользованныйОстатокСтоимости
		|ИЗ
		|	Справочник.ПодарочныеСертификаты КАК ПодарочныеСертификаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПодарочныеСертификаты.Остатки(&Дата, ) КАК ПодарочныеСертификатыОстатки
		|		ПО (ПодарочныеСертификатыОстатки.ПодарочныйСертификат = ПодарочныеСертификаты.Ссылка)
		|ГДЕ
		|	ПодарочныеСертификаты.Ссылка В(&МассивСертификатов)";
	
	Запрос.УстановитьПараметр("Дата", ?(Объект.Ссылка.Пустая(), КонецДня(Объект.Дата), Объект.Дата));
	Запрос.УстановитьПараметр("МассивСертификатов", МассивСертификатов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();                 
	
	СтруктураПоиска = Новый Структура("ПодарочныйСертификат");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, ВыборкаДетальныеЗаписи);
		Строки = Объект.ПодарочныеСертификаты.НайтиСтроки(СтруктураПоиска);
		Строки[0].НеиспользованныйОстатокСтоимости = ВыборкаДетальныеЗаписи.НеиспользованныйОстатокСтоимости;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПодарочныеСертификатыПодарочныйСертификатПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ПодарочныеСертификаты.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ПодарочныйСертификат) Тогда
        ТекущиеДанные.НеиспользованныйОстатокСтоимости = ПодарочныеСертификатыСервер.ПолучитьОстатокСтоимостиПоСертификату(ТекущиеДанные.ПодарочныйСертификат, ?(Объект.Ссылка.Пустая(), КонецДня(Объект.Дата), Объект.Дата));
	Иначе
		ТекущиеДанные.НеиспользованныйОстатокСтоимости = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодарочныеСертификатыПодарочныйСертификатНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.ПодарочныеСертификаты.ФормаВыбора", Новый Структура("ТолькоАктивированные, ТолькоВозвратные, Дата", Истина, Истина, ?(Объект.Ссылка.Пустая(), КонецДня(Объект.Дата), Объект.Дата)), Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПодарочныеСертификатыПриИзменении(Элемент)
	ИтогоСтоимость = ПолучитьИтоговуюСтоимостьПоВалютам();
КонецПроцедуры

&НаСервере
Функция ПолучитьИтоговуюСтоимостьПоВалютам()
	ИтоговыеСтоимостиПоВалютам = Новый Соответствие;
	
	МассивСертификатов = Объект.ПодарочныеСертификаты.Выгрузить(, "ПодарочныйСертификат").ВыгрузитьКолонку("ПодарочныйСертификат");

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ПодарочныеСертификаты.Владелец.НоминальнаяСтоимость) КАК НоминальнаяСтоимость,
		|	ПодарочныеСертификаты.Владелец.Валюта КАК Валюта
		|ИЗ
		|	Справочник.ПодарочныеСертификаты КАК ПодарочныеСертификаты
		|ГДЕ
		|	ПодарочныеСертификаты.Ссылка В(&МассивСертификатов)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПодарочныеСертификаты.Владелец.Валюта";
	
	Запрос.УстановитьПараметр("МассивСертификатов", МассивСертификатов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Результат = "";

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат = Результат + ?(ЗначениеЗаполнено(Результат), Символы.ПС, "") + СтрШаблон("%1 %2", Формат(ВыборкаДетальныеЗаписи.НоминальнаяСтоимость, "ЧДЦ=2; ЧРГ=,; ЧН=0,00"), ВыборкаДетальныеЗаписи.Валюта);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции
